def z1():
    countries = {"Германия":"Берлин", "Франция":"Париж", "Великобритания":"Лондон", "Ирландия":"Дублин", "Нидерланды":"Амстердам", "Бельгия":"Брюссель", "Швейцария":"Берн", "Австрия":"Вена", "Дания":"Копенгаген", "Норвегия":"Осло", "Швеция":"Стокгольм", "Финляндия":"Хельсинки", "Польша":"Варшава", "Чехия":"Прага", "Словакия":"Братислава", "Венгрия":"Будапешт", "Румыния":"Бухарест", "Болгария":"София", "Сербия":"Белград", "Хорватия":"Загреб", "Китай":"Пекин", "Япония":"Токио", "КНДР":"Пхеньян", "Корея":"Сеул", "Вьетнам":"Ханой"}
    for key,value in countries.items():
        print(key + " => " + value)
    print(countries.get(input("Введите название страны для поиска столицы: ")))
    sortedDict = dict(sorted(countries.items(), key=lambda x: x[0].lower()) )
    for k,v in sortedDict.items():
        print('{}:{}'.format(k,v))


def z2():
    list = {1:"АВЕИНОРСТ",
                2:"ДКЛМПУ",
                3:"БГЁЬЯ",
                4:"ЙЫ",
                5:"ЖЗХЦЧ",
                8:"ШЭЮ",
                10:"ФЩЪ"}
    word = input("Введите слово: ").upper()
    summ = 0
    for i in word:
        for k, v in list.items():
            if i in v:
                summ += k
    print("Стоимость слова:", summ, "очков")


def z3():
    student = {
        'Иванов - русский, английский',
        'Смирнов - китайский, французский',
        'Соболев - русский, китайский',
        'Ким - корейский, русский, китайский',
        'Попов - английский, латынь'
    }
    language = set()
    print("Те, кто знает китайский: ", end=" ")
    for x in student:
        y = x.split(" - ")[1].split(", ")
        for i in y:
            if i == "китайский":
                print(x.split(" - ")[0])
        language = language.union(set(y))
    print("Виды языков: ", *sorted(list(language)))
    print("Количество: ", len(list(language)))

